Revit 2024 API
ScheduleDefinition.IsValidCategoryForEmbeddedSchedule Method
 Indicates if a category can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidCategoryForEmbeddedSchedule(
	ElementId categoryId
)
Visual Basic
Public Function IsValidCategoryForEmbeddedSchedule ( _
	categoryId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidCategoryForEmbeddedSchedule(
	ElementId^ categoryId
)
Parameters
categoryId
Type: Autodesk.Revit.DB.ElementId
 The category ID to check.
Return Value
 True if the category can be used for an embedded ScheduleDefinition, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace